## Series

In [2]:
import pandas as pd

In [4]:
s = pd.Series([12, 34, 56, 78, 11])

In [6]:
s

0    12
1    34
2    56
3    78
4    11
dtype: int64

In [8]:
s[2] = 100

In [10]:
s

0     12
1     34
2    100
3     78
4     11
dtype: int64

In [12]:
s = pd.Series([12, 34, 56, 78, 11], index = range(100, 105))

In [14]:
s

100    12
101    34
102    56
103    78
104    11
dtype: int64

In [16]:
s[102]

56

## Dataframes

In [21]:
roll = pd.Series([1, 2, 3, 4, 5])
name = pd.Series(["Akash", "Aryan", "Riya", "Sidhhi", "Niranjan"])
marks = pd.Series([56, 67, 54, 78, 80])

In [23]:
df = pd.DataFrame({
    'roll': roll,
    'name': name,
    'marks': marks
})
df
# https://mitu.co.in/dataset
# download all the files starting from student*

   roll      name  marks
0     1     Akash     56
1     2     Aryan     67
2     3      Riya     54
3     4    Sidhhi     78
4     5  Niranjan     80

In [29]:
df = pd.read_csv("student.csv")

In [31]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21